'use strict';

/**
 * @module
 */

// ----------------------------------------
// Private
// ----------------------------------------

// в этой части файла создаються и описываються
// вспомогательные значения и методы, который будут использованы
// внутри вашего основного кода, ради которого создан этот файл
// Также слово приватный - обозначает что эти значения и методы
// не будут доступны за пределами этого файла

// ----------------------------------------
// Public
// ----------------------------------------

// Ваш основной код
// Он публичен, соответственно к нему
// должен быть доступ ввиде глобального значения,
// или должен формировать публичное API,
// или должен быть частью публичного API,
// или должен эспортироваться как модуль

// ----------------------------------------
// Exports
// ----------------------------------------

// Если это модуль, он должен экспортировать
// Описаный в нем функционал или данные из текущего файла

// ----------------------------------------
// Definitions
// ----------------------------------------

// описание кастомных типов jsdoc
